# -*- coding: utf-8 -*-
'''
Задание 5.1

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''
IP_NET = input("Введите параметры сети в виде СЕТЬ/МАСКА (например - 10.1.1.0/24): ")
IP, MASK = IP_NET.split('/')

IP_VAL = [int(i) for i in IP.split('.')]
IP_TEMPLATE = '''Network:
{0:<8}  {1:<8}  {2:<8}  {3:<8}  
{0:>08b}  {1:>08b}  {2:>08b}  {3:>08b}  
'''
print(IP_TEMPLATE.format(*IP_VAL))

MASK_TXT = '1'*int(MASK) + '0'*(32-int(MASK))
MASK_LST = [MASK_TXT[:8], MASK_TXT[8:16], MASK_TXT[16:24], MASK_TXT[-8:]]
MASK_VAL = [int(i, 2) for i in MASK_LST]

MASK_TEMPLATE = '''Mask:
{0}
{1:<8}  {2:<8}  {3:<8}  {4:<8}  
{1:<08b}  {2:<08b}  {3:<08b}  {4:<08b}  '''

print(MASK_TEMPLATE.format(MASK, *MASK_VAL))
